app/Controllers/AsistenController.php

    public function index()
    {
        $model = new AsistenModel();
        $data['asisten'] = $model->findAll();
---
SELECT *
FROM `asisten`