app/Controllers/login.php

SELECT *
FROM `login`
SELECT *
FROM `asisten`
---
    public function index()
    {

        $data = [
            'login' => $this->model->findAll(),
            'asisten' => $this->modelAsisten->findAll(),
        ];