app/Models/loginModel.php

    public function cek($data)
    {
        return $this->where(['username' => $data['usr'],'password' => $data['pwd']])->first();
---
SELECT *
FROM `login`
WHERE `username` = 'geby'
AND `password` = '1234p'
 LIMIT 1